CSI API ETABS v1

# cFunctionRS Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cFunctionRS

    Public Interface cFunctionRS

    Dim instance As cFunctionRS

    public interface class cFunctionRS

    type cFunctionRS =  interface end

The cFunctionRS type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetNTC2008|  Retrieves the
definition of a NTC2008 response spectrum function
|
GetNTC2018|  Retrieves the
definition of a NTC 2018 response spectrum function
|
SetNTC2008|  Defines a NTC2008
response spectrum function
|
SetNTC2018|  Defines a NTC 2018
response spectrum function
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com